-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 08 2024 г., 13:28
-- Версия сервера: 8.0.12
-- Версия PHP: 7.2.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `material`
--

-- --------------------------------------------------------

--
-- Структура таблицы `material`
--

CREATE TABLE `material` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `type_id` int(11) NOT NULL,
  `language_id` int(4) NOT NULL,
  `date_publish` date DEFAULT NULL,
  `pub_place_id` int(11) DEFAULT NULL,
  `count` int(11) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `date_edit` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `date_add` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `file_path` varchar(512) NOT NULL,
  `status` int(11) NOT NULL DEFAULT '1',
  `kafedra_id` int(11) NOT NULL,
  `comment` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `material`
--

INSERT INTO `material` (`id`, `name`, `type_id`, `language_id`, `date_publish`, `pub_place_id`, `count`, `user_id`, `date_edit`, `date_add`, `file_path`, `status`, `kafedra_id`, `comment`) VALUES
(6, 'Амалияи барномасози дар забони DELPHI.', 1, 1, '2015-01-01', 1, 50, 14, '2024-02-27 15:04:31', '2020-04-18 03:02:50', '', 3, 2, 'говно'),
(7, 'Амалияи барномасози дар забони MICROSOFT C#.', 1, 1, '2015-04-27', 1, 50, 4, '2024-02-21 16:42:18', '2020-04-19 23:17:17', '', 4, 2, '123'),
(8, 'Амалияи барномасози дар забони MICROSOFT VISUAL BASIC.NET', 1, 1, '2015-11-30', 1, 100, 4, '2024-02-21 16:42:40', '2020-04-19 23:22:22', '', 4, 2, '123'),
(11, 'Мачмуаи масъалахо барои фанни \"Амалияи барномарези\".', 3, 1, '2015-01-01', 1, 100, 4, '2024-02-21 16:42:50', '2020-04-27 10:20:25', '', 4, 2, '345'),
(12, 'Основы алгоритмизации и программирования', 1, 1, '2018-04-27', 1, 50, 4, '2024-02-21 16:46:08', '2020-04-27 10:21:49', '', 2, 2, ''),
(13, 'Сохтани лоиҳаи системаҳои иттилоотӣ. ', 1, 2, '2015-01-01', 1, 50, 4, '2024-02-21 17:26:08', '2020-04-27 10:23:06', '', 4, 2, 'Rfv'),
(14, 'Лабораторный практикум по дисциплине: \"Объектно - ориентированное программирование\". Семестр IV. Microsoft VisualBasic', 2, 2, '2015-01-01', 1, 27, 4, '2024-02-21 17:35:09', '2020-04-27 10:25:37', '', 2, 2, ''),
(15, 'MS Word  аз хуччати намуди содда то VBA', 1, 1, '2015-01-01', 1, 251, 4, '2024-02-21 17:43:37', '2020-04-27 10:27:25', '', 2, 2, ''),
(16, 'Амалияи барномасози дар забони MICROSOFT C#.', 1, 1, '2015-01-01', 1, 50, 4, '2024-02-21 17:44:48', '2020-04-27 10:29:54', '', 2, 2, ''),
(17, 'Лабораторный практикум по дисциплине \"Объектно - ориентированное программирование\". Часть I. Семестр III. Microsoft VisualBasic', 2, 2, '2015-01-01', 1, 66, 4, '2024-02-21 17:46:14', '2020-04-27 10:31:31', '', 2, 2, ''),
(18, 'Лабораторный практикум по дисциплине \"Объектно - ориентированное программирование\". Часть I. Семестр III. Microsoft VisualBasic', 2, 2, '2015-01-01', 1, 66, 4, '2024-02-21 17:45:23', '2020-04-27 10:32:17', '', 4, 2, '12345'),
(19, 'Системаи идоракунии манбаи додахо MYSQL.', 1, 1, '2015-01-01', 1, 50, 4, '2024-02-21 17:46:11', '2020-04-27 10:32:56', '', 4, 2, '12345677'),
(20, 'Маводи амали барои фанни \"Базаи маълумоти Access\"', 1, 1, '2015-01-01', 1, 98, 14, '2024-02-24 15:45:08', '2020-04-27 10:34:11', '', 2, 2, ''),
(21, 'Мачмуи масъалахо аз фанни базаи маълумот дар мухити MS ACCESS 2010.', 3, 1, '2015-01-01', 1, 70, 14, '2024-02-24 15:46:26', '2020-04-27 10:35:29', '', 2, 2, ''),
(22, 'Сборник задач по дисциплине база данных в среде MS Access 2010.', 3, 2, '2015-01-01', 1, 100, 14, '2024-02-24 15:54:15', '2020-04-27 10:36:51', '', 2, 2, ''),
(23, 'Сборник задач по дисциплине база данных в среде MS Access 2010.', 3, 2, '2012-03-03', 1, 100, 14, '2024-02-24 15:52:56', '2020-04-27 10:37:38', '', 2, 2, ''),
(24, 'Базаи маълумот-1 : Дастури методии иҷроиши корҳои лабораторӣ.  34 саҳ., 2017с.', 2, 1, '2012-03-03', 1, 50, 14, '2024-02-24 15:54:59', '2020-04-27 10:38:21', '', 2, 2, ''),
(25, 'Базаи маълумот-1 : Дастури методии иҷроиши корҳои мустақилона.  74 саҳ., 2017с.', 2, 1, '2012-03-03', 1, 50, 14, '2024-02-24 15:56:47', '2020-04-27 10:39:07', '', 2, 2, ''),
(26, 'Базаи маълумот-1 : Дастури методии иҷроиши корҳои мустақилона.  74 саҳ., 2017с.', 2, 1, '2012-03-03', 1, 50, 14, '2024-02-24 15:58:00', '2020-04-27 10:39:54', '', 2, 2, ''),
(27, 'Сохтани базаи маълумотҳои шабакавӣ.Маҷмӯи масъалаҳо', 1, 1, '2012-03-03', 1, 50, 4, '2020-04-27 10:40:24', '2020-04-27 10:40:24', '', 1, 2, ''),
(28, 'База данных.', 1, 2, '2012-03-03', 1, 50, 4, '2020-04-27 10:41:22', '2020-04-27 10:41:22', '', 1, 2, ''),
(29, 'Забони дархостхои SQL', 1, 1, '2012-03-03', 1, 143, 4, '2020-04-27 10:42:15', '2020-04-27 10:42:15', '', 1, 2, ''),
(30, 'Технологияҳои мултимедӣ ва графикаи компютерӣ. Дастури методии машғулияти амалӣ-лабораторӣ', 1, 1, '2012-03-03', 1, 50, 4, '2020-04-27 10:43:36', '2020-04-27 10:43:36', '', 1, 2, ''),
(31, 'Барномарези дар мухити .NET Framework. Васоити таълими барои дарсхои амали-лаборатори.', 1, 1, '2012-03-03', 1, 50, 4, '2020-04-27 10:44:37', '2020-04-27 10:44:37', '', 1, 2, ''),
(32, 'Лабораторный практикум по дисциплине \"Программирование в Internet и Web - дизайн\"', 1, 1, '2012-03-03', 1, 50, 4, '2020-04-27 12:57:12', '2020-04-27 10:46:48', '', 1, 2, ''),
(33, 'Барномарези дар мухити .NET Framework. Васоити таълими барои дарсхои амали-лаборатори.', 1, 1, '2012-03-03', 1, 50, 4, '2020-04-27 10:49:05', '2020-04-27 10:49:05', '', 1, 2, ''),
(34, 'ТЕХНОЛОГИЯИ СОХТАНИ ЗАМИМАХО БО FRAMEWORK', 1, 1, '2012-03-03', 1, 51, 4, '2020-04-27 10:55:07', '2020-04-27 10:55:07', '', 1, 2, ''),
(35, 'Лабораторный практикум по дисциплине \"Программирование в Internet и Web - дизайн\"', 1, 2, '2012-03-03', 1, 51, 4, '2020-04-27 11:01:15', '2020-04-27 11:01:15', '', 1, 2, ''),
(36, 'Лабораторный практикум по дисциплине \"Программирование в Internet и Web - дизайн\"', 1, 2, '2012-03-03', 1, 51, 14, '2024-02-24 15:53:58', '2020-04-27 11:02:13', '', 2, 2, ''),
(37, 'МАЧМУАИ МАСЪАЛАХО БАРОИ ФАННИ \"БАРНОМАРЕЗИ ДАР ИНТЕРНЕТ\"', 2, 1, '2012-03-03', 1, 100, 4, '2020-04-27 11:03:40', '2020-04-27 11:03:40', '', 1, 2, ''),
(38, 'МАЧМУАИ МАСЪАЛАХО БАРОИ ФАННИ \"БАРНОМАРЕЗИ ДАР ИНТЕРНЕТ\"', 2, 1, '2012-03-03', 1, 100, 4, '2020-04-27 11:04:01', '2020-04-27 11:04:01', '', 1, 2, ''),
(39, 'Макроиқтисодиёт. Маҷмӯи масъалаҳо', 2, 1, '2017-12-27', 1, 50, 4, '2020-04-27 13:25:27', '2020-04-27 11:04:38', '', 1, 2, ''),
(40, ' Микриқтисодиёт.', 1, 1, '2007-12-14', 1, 300, 4, '2020-04-27 13:18:05', '2020-04-27 11:10:09', '', 1, 2, ''),
(41, ' Макроиқтисодиёт (маҷмӯаи масъалаҳо)', 2, 2, '2009-12-21', 1, 1, 4, '2020-04-27 13:20:52', '2020-04-27 11:13:39', '', 1, 2, ''),
(42, ' Макроиқтисодиёт (курси лексияҳо)', 1, 1, '1900-12-27', 1, 300, 4, '2020-04-27 15:11:37', '2020-04-27 11:26:57', '', 1, 2, ''),
(43, ' Макроэкономика. Сборник задач', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 11:28:31', '2020-04-27 11:28:31', '', 1, 2, ''),
(44, 'Менеҷмент (қисми 1)', 1, 1, '2017-12-27', 1, -1, 4, '2020-04-27 11:29:44', '2020-04-27 11:29:44', '', 1, 2, ''),
(45, 'Менеҷмент. Китоби дарсӣ', 1, 1, '2017-12-27', 1, 1, 4, '2020-04-27 11:31:36', '2020-04-27 11:31:36', '', 1, 2, ''),
(46, 'Ташкили истеҳсолот дар корхона. Китоби дарсӣ', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 11:33:22', '2020-04-27 11:33:22', '', 1, 2, ''),
(47, 'Менеҷмент. Курс лекқии', 1, 2, '2017-12-27', 1, 122, 4, '2020-04-27 11:34:34', '2020-04-27 11:34:34', '', 1, 2, ''),
(48, 'Основы алгоритмизации и программирования\"', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 11:36:57', '2020-04-27 11:36:57', '', 1, 2, ''),
(49, 'Мачмуаи масъалахо барои фанни \"Амалияи барномарези\".', 1, 1, '2017-12-27', 1, 100, 4, '2020-04-27 11:38:07', '2020-04-27 11:38:07', '', 1, 2, ''),
(50, 'Амалияи барномасози дар забони MICROSOFT VISUAL BASIC. NET.', 1, 1, '2017-12-27', 1, 100, 4, '2020-04-27 11:38:47', '2020-04-27 11:38:47', '', 1, 2, ''),
(51, 'Мачмуаи масъалахо барои фанни \"Амалияи барномарези\".', 1, 1, '2017-12-27', 1, 100, 4, '2020-04-27 11:39:38', '2020-04-27 11:39:38', '', 1, 2, ''),
(52, 'Амалияи барномасози дар забони MICROSOFT VISUAL BASIC. NET.', 1, 1, '2024-01-16', 1, 100, 4, '2020-04-27 11:40:09', '2020-04-27 11:40:09', '', 1, 2, ''),
(53, 'Амалияи барномасози дар забони MICROSOFT VISUAL BASIC. NET.', 1, 1, '2017-12-27', 1, 100, 4, '2020-04-27 11:40:47', '2020-04-27 11:40:47', '', 1, 2, ''),
(54, 'Основы WEB - дизайна. Текст лекций', 1, 2, '2017-12-27', 1, 100, 4, '2020-04-27 11:41:36', '2020-04-27 11:41:36', '', 1, 2, ''),
(55, 'Основы Web-дизайна. Сборник заданий.', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 11:42:20', '2020-04-27 11:42:20', '', 1, 2, ''),
(56, 'Лабораторный практикум по дисциплине \"Программирование в Internet и Web - дизайн\"', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 11:43:03', '2020-04-27 11:43:03', '', 1, 2, ''),
(57, 'Лабораторный практикум по дисциплине \"Программирование в Internet и Web - дизайн\"', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 11:43:33', '2020-04-27 11:43:33', '', 1, 2, ''),
(58, 'Дастури методи барои гузаронидани машгулияти амали-лаборатори аз фанни \"Асосхои Web-дизайн\"', 2, 1, '2017-12-27', 1, 100, 4, '2020-04-27 11:44:15', '2020-04-27 11:44:15', '', 1, 2, ''),
(59, 'Основы алгоритмизации и программирования\"', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 11:44:57', '2020-04-27 11:44:57', '', 1, 2, ''),
(60, 'Лабораторный практикум по дисциплине \"Основы программирования \" Microsoft QBasic', 1, 2, '2017-12-27', 1, 63, 4, '2020-04-27 11:45:44', '2020-04-27 11:45:44', '', 1, 2, ''),
(61, 'Мачмуи масъалахо аз барномасози.', 3, 1, '2017-12-27', 1, 100, 4, '2020-04-27 11:46:55', '2020-04-27 11:46:55', '', 1, 2, ''),
(62, 'Мачмуи масъалахо аз барномасози.', 3, 1, '2017-12-27', 1, 100, 4, '2020-04-27 11:48:07', '2020-04-27 11:48:07', '', 1, 2, ''),
(63, 'Сохтани лоиҳаи системаҳои иттилоотӣ. ', 1, 1, '2017-12-27', 1, 51, 4, '2020-04-27 11:48:48', '2020-04-27 11:48:48', '', 1, 2, ''),
(64, 'MS Word  аз хуччати намуди содда то VBA', 1, 1, '2017-12-27', 1, 708, 4, '2020-04-27 11:50:51', '2020-04-27 11:50:51', '', 1, 2, ''),
(65, 'Лабораторный практикум по дисциплине: \"Объектно - ориентированное программирование\". Семестр IV. Microsoft VisualBasic', 1, 2, '2017-12-27', 1, 27, 4, '2020-04-27 11:51:49', '2020-04-27 11:51:49', '', 1, 2, ''),
(66, 'Барномарези ба тачхизоти мобили. Матни лексияхо.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 11:54:37', '2020-04-27 11:54:37', '', 1, 2, ''),
(67, 'Мачмуи масъалахо аз барномасози.', 1, 1, '2017-12-27', 1, 100, 4, '2020-04-27 11:55:58', '2020-04-27 11:55:58', '', 1, 2, ''),
(68, 'Амалияи барномасози дар забони MICROSOFT C#.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 11:57:19', '2020-04-27 11:57:19', '', 1, 2, ''),
(69, 'Мультимедийная технология и компьютерная графика.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 11:58:17', '2020-04-27 11:58:17', '', 1, 2, ''),
(70, 'Технологияҳои мултимедӣ ва графикаи компютерӣ. Дастури методии машғулияти амалӣ-лабораторӣ', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 11:59:01', '2020-04-27 11:59:01', '', 1, 2, ''),
(71, 'Лабораторный практикум по дисциплине \"Программирование в Internet и Web - дизайн\"', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 12:00:15', '2020-04-27 12:00:15', '', 1, 2, ''),
(72, 'Системаи идоракунии манбаи додахо MYSQL.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 12:01:10', '2020-04-27 12:01:10', '', 1, 2, ''),
(73, 'Маводи амали барои фанни \"Базаи маълумоти Access\"', 1, 1, '2017-12-27', 1, 100, 4, '2020-04-27 12:02:18', '2020-04-27 12:02:18', '', 1, 2, ''),
(74, 'Мачмуи масъалахо аз фанни базаи маълумот дар мухити MS ACCESS 2010.', 1, 1, '2017-12-27', 1, 65, 4, '2020-04-27 12:03:25', '2020-04-27 12:03:25', '', 1, 2, ''),
(75, 'Базаи маълумот-1 : Дастури методии иҷроиши корҳои мустақилона.  74 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 12:07:10', '2020-04-27 12:07:10', '', 1, 2, ''),
(76, 'Сохтани базаи маълумотҳои шабакавӣ.Маҷмӯи масъалаҳо', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 12:07:56', '2020-04-27 12:07:56', '', 1, 2, ''),
(77, 'База данных.', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 12:08:49', '2020-04-27 12:08:49', '', 1, 2, ''),
(78, 'Забони дархостхои SQL', 1, 1, '2017-12-27', 1, 147, 4, '2020-04-27 12:09:38', '2020-04-27 12:09:38', '', 1, 2, ''),
(79, 'Забони дархостхои SQL', 1, 1, '2017-12-27', 1, 147, 4, '2020-04-27 12:10:10', '2020-04-27 12:10:10', '', 1, 2, ''),
(80, 'Операционные системы. Курс лекций. Часть1', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 12:12:43', '2020-04-27 12:12:43', '', 1, 2, ''),
(81, 'Операционные системы. Курс лекций. Часть1', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 12:13:44', '2020-04-27 12:13:44', '', 1, 2, ''),
(82, 'Информатика', 1, 1, '2017-12-27', 1, 120, 4, '2020-04-27 12:22:18', '2020-04-27 12:22:18', '', 1, 2, ''),
(83, 'Технологияи информатсионӣ : маҷмӯи масъалаҳо.  50 саҳ., 2017с. ', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 12:23:35', '2020-04-27 12:23:35', '', 1, 2, ''),
(84, 'Технологияи информатсионӣ : маҷмӯи масъалаҳо.  16 саҳ., 2017с. ', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 12:24:36', '2020-04-27 12:24:36', '', 1, 2, ''),
(85, 'Технологияи информатсионӣ : Матни лексия.  59 саҳ.,  2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 14:26:10', '2020-04-27 12:25:32', '', 1, 2, ''),
(86, 'Информационные технологии. Лабораторный практикум.', 2, 2, '2017-12-27', 1, 50, 4, '2020-04-27 12:27:37', '2020-04-27 12:27:37', '', 1, 2, ''),
(87, 'Информационные технологии. Лабораторный практикум.', 2, 2, '2017-12-27', 1, 50, 4, '2020-04-27 12:29:03', '2020-04-27 12:29:03', '', 1, 2, ''),
(88, 'Технологияи инфоратсиони. Мачмуи масъалахо.', 2, 1, '2017-12-27', 1, 50, 4, '2020-04-27 12:29:42', '2020-04-27 12:29:42', '', 1, 2, ''),
(89, 'Технологияи информатсиони. Мачмуи машкхо.', 2, 1, '2017-12-27', 1, 50, 4, '2020-04-27 12:30:21', '2020-04-27 12:30:21', '', 1, 2, ''),
(90, 'Технологияи иттилоотӣ.  Дастури методӣ', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 12:31:04', '2020-04-27 12:31:04', '', 1, 2, ''),
(91, 'Технологияи информатсиони. Дастури методи', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 12:31:46', '2020-04-27 12:31:46', '', 1, 2, ''),
(92, 'Информационные технологии. Задания и методические указания. ', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 12:32:38', '2020-04-27 12:32:38', '', 1, 2, ''),
(93, 'Лабораторный практикум по дисциплине: \"Информатика\". Семестр IV. VBA для приложений', 1, 2, '2017-12-27', 1, 71, 4, '2020-04-27 12:33:23', '2020-04-27 12:33:23', '', 1, 2, ''),
(94, 'Технологияҳои мултимедӣ ва графикаи компютерӣ. Дастури методии машғулияти амалӣ-лабораторӣ', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-27 14:37:42', '2020-04-27 12:34:06', '', 1, 2, ''),
(95, 'Барномарези дар мухити .NET Framework. Васоити таълими барои дарсхои амали-лаборатори.', 2, 2, '2017-12-27', 1, 50, 4, '2020-04-27 14:37:06', '2020-04-27 12:34:53', '', 1, 2, ''),
(96, 'Лабораторный практикум по дисциплине \"Программирование в Internet и Web - дизайн\"', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 12:36:23', '2020-04-27 12:36:23', '', 1, 2, ''),
(97, 'ТЕХНОЛОГИЯИ СОХТАНИ ЗАМИМАХО БО FRAMEWORK', 1, 1, '2017-12-27', 1, 51, 4, '2020-04-27 12:38:51', '2020-04-27 12:38:51', '', 1, 2, ''),
(98, 'Задачник по предмету \"Организация защиты информации\".', 3, 2, '2017-12-27', 1, 50, 4, '2020-04-27 12:41:38', '2020-04-27 12:41:38', '', 1, 2, ''),
(99, 'МАЧМУАИ МАСЪАЛАХО БАРОИ ФАННИ \"БАРНОМАРЕЗИ ДАР ИНТЕРНЕТ\"', 2, 1, '2017-12-27', 1, 100, 4, '2020-04-27 12:42:49', '2020-04-27 12:42:49', '', 1, 2, ''),
(100, 'Матни лексияҳо', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 14:53:06', '2020-04-27 12:52:43', '', 1, 2, ''),
(101, 'Китоби дарсӣ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:03:31', '2020-04-27 13:03:31', '', 1, 2, ''),
(102, 'Амалия', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:04:15', '2020-04-27 13:04:15', '', 1, 2, ''),
(103, 'Маҷмӯи лексияҳо ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:05:01', '2020-04-27 13:05:01', '', 1, 2, ''),
(104, 'Дастури методӣ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:05:33', '2020-04-27 13:05:33', '', 1, 2, ''),
(105, 'Маводи имтиҳонӣ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:06:12', '2020-04-27 13:06:12', '', 1, 2, ''),
(106, 'Дастури таълимӣ ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:06:56', '2020-04-27 13:06:56', '', 1, 2, ''),
(107, 'Курс Лексияҳо ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:08:18', '2020-04-27 13:08:18', '', 1, 2, ''),
(108, 'Курс Лексияҳо ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:09:06', '2020-04-27 13:09:06', '', 1, 2, ''),
(109, 'Тенниси рӯимиз', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:10:37', '2020-04-27 13:10:37', '', 1, 2, ''),
(110, 'Тенниси рӯимиз', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:15:44', '2020-04-27 13:15:44', '', 1, 2, ''),
(111, 'Воситаи таълимӣ ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:16:36', '2020-04-27 13:16:36', '', 1, 2, ''),
(112, 'Гуштини тарзи озод', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:17:17', '2020-04-27 13:17:17', '', 1, 2, ''),
(113, 'Дастури таълимӣ ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:19:16', '2020-04-27 13:19:16', '', 1, 2, ''),
(114, 'Адабиёти дарсӣ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:21:28', '2020-04-27 13:21:28', '', 1, 2, ''),
(115, 'Матни лексияҳо', 1, 1, '2024-01-16', 1, 50, 4, '2020-04-27 13:23:02', '2020-04-27 13:23:02', '', 1, 2, ''),
(116, 'Матни лексияҳо оид ба машғулиятҳои назариявӣ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:23:54', '2020-04-27 13:23:54', '', 1, 2, ''),
(117, 'Курс Лексияҳо ', 1, 1, '2024-01-16', 1, 50, 4, '2020-04-27 13:25:39', '2020-04-27 13:25:39', '', 1, 2, ''),
(118, 'Дастури методӣ ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:26:41', '2020-04-27 13:26:41', '', 1, 2, ''),
(119, 'Курси лексияҳо ', 1, 1, '1900-12-28', 1, 50, 4, '2020-04-27 13:36:28', '2020-04-27 13:36:28', '', 1, 2, ''),
(120, 'Курси лексияҳо ', 1, 1, '2024-01-16', 1, 50, 4, '2020-04-27 13:38:02', '2020-04-27 13:38:02', '', 1, 2, ''),
(121, 'Технологияи сохтани шабакахои компютери.', 1, 1, '1900-12-28', 1, 100, 4, '2020-04-27 13:38:37', '2020-04-27 13:38:37', '', 1, 2, ''),
(122, 'Технологияи сохтани шабакахои компютери.', 1, 1, '1900-12-28', 1, 100, 4, '2020-04-27 13:39:48', '2020-04-27 13:39:48', '', 1, 2, ''),
(123, 'Задачник по предмету \"Организация защиты информации\".', 3, 2, '1900-12-28', 1, 50, 4, '2020-04-27 13:40:21', '2020-04-27 13:40:21', '', 1, 2, ''),
(124, 'Задачник по предмету \"Организация защиты информации\".', 3, 2, '2017-12-27', 1, 50, 4, '2020-04-27 13:40:44', '2020-04-27 13:40:44', '', 1, 2, ''),
(125, 'Логистика.(Учебно-методический комплекс)', 1, 2, '2017-12-27', 1, 100, 4, '2020-04-27 13:41:23', '2020-04-27 13:41:23', '', 1, 2, ''),
(126, 'Логистика.(Комплекси таълимию методи)', 1, 2, '2017-12-27', 1, 99, 4, '2020-04-27 13:43:22', '2020-04-27 13:43:22', '', 1, 2, ''),
(127, 'Логистика.(Комплекси таълимию методи)', 1, 2, '2017-12-27', 1, 99, 4, '2020-04-27 13:44:28', '2020-04-27 13:44:28', '', 1, 2, ''),
(128, 'Логистика.(Комплекси таълимию методи)', 1, 2, '2017-12-27', 1, 99, 4, '2020-04-27 13:44:57', '2020-04-27 13:44:57', '', 1, 2, ''),
(129, 'Логистика.(Комплекси таълимию методи)', 1, 2, '2017-12-27', 1, 99, 4, '2020-04-27 13:45:22', '2020-04-27 13:45:22', '', 1, 2, ''),
(130, 'Операционные системы. Курс лекций. Часть1', 1, 2, '2017-12-27', 1, 50, 4, '2020-04-27 13:45:47', '2020-04-27 13:45:47', '', 1, 2, ''),
(131, 'Операционные системы. Лабораторный практикум. Часть 1', 2, 2, '2017-12-27', 1, 50, 4, '2020-04-27 13:46:33', '2020-04-27 13:46:33', '', 1, 2, ''),
(132, 'Дастури таълими аз фанни: \"Амсиласози ва ороиши бадеии либос\"', 1, 1, '2024-01-16', 1, 1, 4, '2020-04-30 10:37:34', '2020-04-30 10:37:34', '', 1, 2, ''),
(133, 'Дастури таълими аз фанни \"Амсиласози ва ороиши бадеии либос\".', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 10:38:41', '2020-04-30 10:38:41', '', 1, 2, ''),
(134, 'Китоби дарсӣ \"Асосҳои антропология ва биомеханика\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 10:39:40', '2020-04-30 10:39:40', '', 1, 2, ''),
(135, '\"Супориш ва дастури методӣ Барои иҷрои кори мустақилонаи назоратӣ\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:42:09', '2020-04-30 10:40:59', '', 1, 2, ''),
(136, '\"Супориш ва дастури методӣ Барои иҷрои кори мустақилонаи назоратӣ\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 10:43:47', '2020-04-30 10:43:47', '', 1, 2, ''),
(137, 'Дастури таълимии мухтасар \"Дизайни компютерӣ\"', 1, 1, '2017-12-27', 1, 60, 4, '2020-04-30 10:44:50', '2020-04-30 10:44:50', '', 1, 2, ''),
(138, 'Маҷмӯаи мисолу масъалаҳо аз масолеҳшиносии маснуоти дӯзандагӣ', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 10:46:11', '2020-04-30 10:46:11', '', 1, 2, ''),
(139, 'Маводи таълимӣ - методӣ \"Моделирони ва ороиши бадеии либос', 1, 1, '2024-01-16', 1, 50, 4, '2020-04-30 10:47:43', '2020-04-30 10:47:43', '', 1, 2, ''),
(140, 'китоби дарсӣ \"Тарҳрезии либоси бачагона\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 10:49:57', '2020-04-30 10:49:57', '', 1, 2, ''),
(141, 'Маҷмӯи мисолу масъалаҳо аз фанни \"Тарҳрезии либос-1\"', 1, 1, '2024-01-16', 1, 50, 4, '2020-04-30 10:51:06', '2020-04-30 10:51:06', '', 1, 2, ''),
(142, 'Дастури таълимӣ аз фанни \"Усули ягонаи тарроҳии либос\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:53:36', '2020-04-30 10:52:24', '', 1, 2, ''),
(143, 'Комплекси маводи таълимӣ \"Тарҳрезии либоси таъиноташ гуногун\"', 1, 1, '2024-01-16', 1, 100, 4, '2020-04-30 10:54:35', '2020-04-30 10:54:35', '', 1, 2, ''),
(144, 'Дастури методӣ \"Таърихи либос ва мӯд\"', 1, 1, '2017-12-27', 1, 5, 4, '2020-04-30 10:55:31', '2020-04-30 10:55:31', '', 1, 2, ''),
(145, 'Дастури таълимии мухтасар \"Технологияи маснуоти саноати сабук\"', 1, 1, '2024-01-16', 1, 50, 4, '2020-04-30 10:58:19', '2020-04-30 10:58:19', '', 1, 2, ''),
(146, 'Курси лексия Ҳамбастигии либос', 1, 1, '2017-12-27', 1, 60, 4, '2020-04-30 10:59:31', '2020-04-30 10:59:31', '', 1, 2, ''),
(147, '\"Супориш ва дастури методӣ Барои иҷрои кори  амалӣ \"', 1, 1, '2024-01-16', 1, 50, 4, '2020-04-30 11:00:28', '2020-04-30 11:00:28', '', 1, 2, ''),
(148, '\"Супориш ва дастури методӣ Барои иҷрои кори  амалӣ \"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 11:16:18', '2020-04-30 11:16:18', '', 1, 2, ''),
(149, 'Мачмуаи масъалахо аз масолехшиносии маснуоти дузандаги.', 1, 1, '2024-01-16', 1, 50, 4, '2020-04-30 11:17:18', '2020-04-30 11:17:18', '', 1, 2, ''),
(150, '\"Масолехшиносии истехсолоти дузандаги.  Маводи таълими.\"', 1, 1, '2017-12-27', 1, 2, 4, '2020-04-30 11:18:08', '2020-04-30 11:18:08', '', 1, 2, ''),
(151, 'Дастури методи аз фанни \"Масолехшиносии истехсоли дузандаги\"', 1, 1, '2017-12-27', 1, 2, 4, '2020-04-30 11:18:53', '2020-04-30 11:18:53', '', 1, 2, ''),
(152, 'Комплекси маводи таълими аз фанни \"Масолехшиносии истехсолоти дузандаги\"', 1, 1, '2017-12-27', 1, 2, 4, '2020-04-30 11:19:50', '2020-04-30 11:19:50', '', 1, 2, ''),
(153, 'Комплекси маводи таълими аз фанни \"Масолехшиносии истехсолоти дузандаги\"', 1, 1, '2017-12-27', 1, 2, 4, '2020-04-30 11:20:24', '2020-04-30 11:20:24', '', 1, 2, ''),
(154, 'Графикаи мухандиси', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 11:21:08', '2020-04-30 11:21:08', '', 1, 2, ''),
(155, 'Графикаи мухандиси', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 11:25:35', '2020-04-30 11:25:35', '', 1, 2, ''),
(156, 'Асосхои истифодабарии техникаи автомобилхо.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 11:41:39', '2020-04-30 11:41:39', '', 1, 2, ''),
(157, 'Дастгоҳҳо ва тачҳизотҳо барои таъмири автомобилҳо-2 : Конспекти лексияҳо.  45 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 11:42:32', '2020-04-30 11:42:32', '', 1, 2, ''),
(158, 'Дастгоххо ва тачхизотхо барои таъмири автомобилхо. Кисми 1.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 11:43:37', '2020-04-30 11:43:37', '', 1, 2, ''),
(159, 'Мачмуаи масъалахо аз механикаи техники.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:45:22', '2020-04-30 12:45:22', '', 1, 2, ''),
(160, '\"Механикаи назарияви ва муковимати масолеххо.  Конспекти лексияхо.\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:46:08', '2020-04-30 12:46:08', '', 1, 2, ''),
(161, 'Асосҳои механика ва муқовимати масолеҳҳо. Конспекти лексияҳо. (Қисми 2)', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:46:48', '2020-04-30 12:46:48', '', 1, 2, ''),
(162, 'Асосхои бехатарии харакат дар роххои автомобилгард.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 15:19:45', '2020-04-30 12:47:58', '', 1, 2, ''),
(163, 'Хизматрасони ба автомобилхо-1.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:48:59', '2020-04-30 12:48:59', '', 1, 2, ''),
(164, 'Диагностика, таъмир ва хизматрасонӣ ба автомобилҳо-1 : курси лексияҳо.  90 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:50:04', '2020-04-30 12:50:04', '', 1, 2, ''),
(165, '\"Диагностика, таъмир ва хизматрасони ба автомобилхо - 5.  Курси лексияхо.\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:51:40', '2020-04-30 12:51:40', '', 1, 2, ''),
(166, 'Блоки идоракунии электронии мухаррикхои дизели', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:52:31', '2020-04-30 12:52:31', '', 1, 2, ''),
(167, 'Блоки идоракунии электронии мухаррикхои дизели', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:55:40', '2020-04-30 12:55:40', '', 1, 2, ''),
(168, 'Диагностика,таъмир ва хизматрасони ба автомобилхо-3', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:56:39', '2020-04-30 12:56:39', '', 1, 2, ''),
(169, 'Блоки идоракунии электронии мухаррикхои дизели', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:57:49', '2020-04-30 12:57:49', '', 1, 2, ''),
(170, 'Иқтисодиёти соҳаи хизматрасонии автомобилӣ : Конспекти лексияҳо.  50 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:58:37', '2020-04-30 12:58:37', '', 1, 2, ''),
(171, '\"Истифодабарии техникии  автомобилҳо\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 12:59:30', '2020-04-30 12:59:30', '', 1, 2, ''),
(172, 'Асосхои бехатарии харакат дар роххои автомобилгард.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:00:50', '2020-04-30 13:00:50', '', 1, 2, ''),
(173, 'Асосхои бехатарии харакат дар роххои автомобилгард.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:01:31', '2020-04-30 13:01:31', '', 1, 2, ''),
(174, 'Масолеххои дар автомобил истифодашаванда : Васоити машғулиятҳои амалии озмоишгоҳӣ. 76 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:02:45', '2020-04-30 13:02:45', '', 1, 2, ''),
(175, 'Масолеххои дар автомобил истифодашаванда : Конспекти лексияҳо. 55 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:03:43', '2020-04-30 13:03:43', '', 1, 2, ''),
(176, 'Масолеххои дар автомобил истифодашаванда. Матни лексияхо.(кисми 2)', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:04:26', '2020-04-30 13:04:26', '', 1, 2, ''),
(177, 'Масолеҳшиносӣ ва технологияи масолеҳҳои конструксионӣ : Курси лексияхо.  84 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:05:24', '2020-04-30 13:05:24', '', 1, 2, ''),
(178, 'Масолеҳшиносӣ ва технологияи масолеҳҳои конструксионӣ : Дастури методӣ барои дарсҳои амалӣ-лабораторӣ.   41 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:06:19', '2020-04-30 13:06:19', '', 1, 2, ''),
(179, 'Дастгоҳҳо ва тачҳизотҳо барои таъмири автомобилҳо-2 : Конспекти лексияҳо.  45 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:07:34', '2020-04-30 13:07:34', '', 1, 2, ''),
(180, 'Дастгоххо ва тачхизотхо барои таъмири автомобилхо. Кисми 1.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:08:38', '2020-04-30 13:08:38', '', 1, 2, ''),
(181, 'Диагностика, таъмир ва хизматрасонӣ ба автомобилҳо-1 : курси лексияҳо.  90 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:09:19', '2020-04-30 13:09:19', '', 1, 2, ''),
(182, 'Диагностика, таъмир ва хизматрасонӣ ба автомобилҳо-2 : Курси лексияҳо.  30 саҳ., 2017с.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:09:55', '2020-04-30 13:09:55', '', 1, 2, ''),
(183, '\"Диагностика, таъмир ва хизматрасони ба автомобилхо - 5.  Курси лексияхо.\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:10:37', '2020-04-30 13:10:37', '', 1, 2, ''),
(184, 'Сохт ва конструксияхои автомобилхо. Воситаи таълим', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:11:19', '2020-04-30 13:11:19', '', 1, 2, ''),
(185, 'Сохт ва конструксияхои автомобилхо. Воситаи таълим', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:12:18', '2020-04-30 13:12:18', '', 1, 2, ''),
(186, 'Сохт ва конструксияхои автомобилхо. Воситаи таълим', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:13:11', '2020-04-30 13:13:11', '', 1, 2, ''),
(187, 'Сохт ва конструксияхои автомобилхо. Воситаи таълим', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:14:40', '2020-04-30 13:14:40', '', 1, 2, ''),
(188, '\"Диагностика, таъмир ва хизматрасони ба автомобилхо - 5.  Курси лексияхо.\"', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:15:30', '2020-04-30 13:15:30', '', 1, 2, ''),
(189, 'Асосхои бехатарии харакат дар роххои автомобилгард.', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:16:23', '2020-04-30 13:16:23', '', 1, 2, ''),
(190, 'Конспекти лексияҳо', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:30:40', '2020-04-30 13:30:40', '', 1, 2, ''),
(191, 'Супориш оид ба иҷрои корҳои мустақилонаи назоратшаванда', 3, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:31:47', '2020-04-30 13:31:47', '', 1, 2, ''),
(192, 'курси лексияҳо', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:33:00', '2020-04-30 13:33:00', '', 1, 2, ''),
(193, 'дастури методӣ оид ба иҷроиши корҳои лабораторӣ', 2, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:33:49', '2020-04-30 13:33:49', '', 1, 2, ''),
(194, 'дастури методӣ ', 1, 1, '2017-12-27', 1, 28, 4, '2020-04-30 13:35:15', '2020-04-30 13:35:15', '', 1, 2, ''),
(195, 'Конспекти лексияҳо', 1, 1, '2017-12-27', 1, 50, 4, '2020-04-30 13:36:35', '2020-04-30 13:36:35', '', 1, 2, ''),
(196, 'Конспекти лексияҳо', 1, 1, '2017-12-27', 1, 50, 3, '2024-01-08 14:27:39', '2024-01-08 13:49:49', '2_Абрамян_М_Э_Электронный_задачник_по_программированию.pdf', 1, 2, ''),
(197, 'Burgers', 1, 2, '2024-01-16', 1, 25, 3, '2024-01-13 14:05:46', '2024-01-13 14:05:46', '65a2526ab0eb2.pdf', 1, 2, ''),
(198, 'Burgers', 1, 2, '2024-01-16', 2, 25, 3, '2024-01-13 14:06:06', '2024-01-13 14:06:06', '65a2527ebc546.pdf', 1, 2, ''),
(199, 'Burgers', 1, 3, '2024-01-16', 2, 25, 3, '2024-01-13 14:13:54', '2024-01-13 14:13:54', '65a2545266310.txt', 1, 2, ''),
(200, 'Burgers', 1, 3, '2024-01-16', 2, 25, 3, '2024-01-13 14:15:05', '2024-01-13 14:15:05', '65a25499c3029.txt', 1, 2, ''),
(201, 'Burgers', 1, 3, '2024-01-16', 2, 25, 3, '2024-01-13 14:30:49', '2024-01-13 14:30:49', '65a25849607a8.txt', 1, 2, ''),
(202, 'Burgers', 1, 3, '2024-01-16', 2, 25, 3, '2024-01-13 14:31:18', '2024-01-13 14:31:18', '65a258662b9e5.txt', 1, 2, ''),
(203, 'Burgers', 1, 2, '2024-01-16', 1, 1, 3, '2024-01-13 14:31:45', '2024-01-13 14:31:45', '65a258812826f.jpg', 1, 2, ''),
(204, 'Burgers', 1, 3, '2024-01-16', 2, 25, 3, '2024-01-13 14:35:43', '2024-01-13 14:35:43', '65a2596f1b7b2.txt', 1, 2, ''),
(205, 'Burgers', 1, 2, '2024-01-16', 1, 33, 3, '2024-01-13 14:36:22', '2024-01-13 14:36:22', '65a259961c812.pdf', 1, 2, ''),
(206, 'Burgers', 1, 2, '2024-01-16', 1, 25, 3, '2024-01-13 14:38:29', '2024-01-13 14:38:29', '65a25a15f17d2.pdf', 1, 2, ''),
(207, 'Burgers', 1, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:00:49', '2024-01-13 15:00:49', '65a25f512299b.pdf', 1, 2, ''),
(208, 'Burgers', 1, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:09:26', '2024-01-13 15:09:26', '65a2615627648.pdf', 1, 2, ''),
(209, 'Burgers', 1, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:09:27', '2024-01-13 15:09:27', '65a261576a482.pdf', 1, 2, ''),
(210, 'Burgers', 1, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:10:48', '2024-01-13 15:10:48', '65a261a80de2d.pdf', 1, 2, ''),
(211, 'Burgers', 1, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:10:49', '2024-01-13 15:10:49', '65a261a9c6d6f.pdf', 1, 2, ''),
(212, 'Burgers', 1, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:11:03', '2024-01-13 15:11:03', '65a261b78fd19.pdf', 1, 2, ''),
(213, 'Burgers', 1, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:11:30', '2024-01-13 15:11:30', '65a261d2d5cdb.pdf', 1, 2, ''),
(214, 'Толстой', 1, 1, '2024-01-16', 1, 25, 3, '2024-01-13 15:33:17', '2024-01-13 15:33:17', '65a266ed666fc.xlsx', 1, 2, ''),
(215, 'Толстой', 1, 1, '2024-01-16', 1, 25, 3, '2024-01-13 15:33:51', '2024-01-13 15:33:51', '65a2670f6ab15.xlsx', 1, 2, ''),
(216, 'Толстой', 1, 1, '2024-01-16', 1, 25, 3, '2024-01-13 15:36:18', '2024-01-13 15:36:18', '65a267a26ba59.xlsx', 1, 2, ''),
(217, 'Толстой', 2, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:40:11', '2024-01-13 15:40:11', '65a2688b5eedd.xlsx', 1, 2, ''),
(218, 'Толстой', 2, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:42:36', '2024-01-13 15:42:36', '65a2691c2793d.xlsx', 1, 2, ''),
(219, 'Толстой', 2, 2, '2024-01-16', 1, 25, 3, '2024-01-13 15:47:12', '2024-01-13 15:47:12', '65a26a304530e.xlsx', 1, 2, ''),
(220, 'Толстой', 1, 1, '2024-01-16', 1, 25, 3, '2024-01-13 15:47:35', '2024-01-13 15:47:35', '65a26a47b3add.png', 1, 2, ''),
(221, 'Толстой', 1, 1, '2024-01-16', 1, 25, 3, '2024-01-13 15:49:06', '2024-01-13 15:49:06', '65a26aa2eb31f.png', 1, 2, ''),
(222, 'paradox29', 1, 2, '2024-01-16', 2, 34, 3, '2024-01-13 16:05:28', '2024-01-13 16:05:28', '65a26e78a6bc1.png', 1, 2, ''),
(223, 'paradox29', 2, 2, '2024-01-16', 1, 34, 3, '2024-01-13 16:07:02', '2024-01-13 16:07:02', '65a26ed6bdb7b.png', 1, 2, ''),
(224, 'paradox29', 2, 2, '2024-01-16', 1, 34, 3, '2024-01-13 16:07:38', '2024-01-13 16:07:38', '65a26efa2bcfd.png', 1, 2, ''),
(225, 'paradox29', 2, 2, '2024-01-16', 1, 1, 3, '2024-01-13 16:09:05', '2024-01-13 16:09:05', '65a26f51a7681.txt', 1, 2, ''),
(226, 'paradox29', 2, 2, '2024-01-16', 1, 1, 3, '2024-01-13 16:09:35', '2024-01-13 16:09:35', '65a26f6fd2401.txt', 1, 2, ''),
(227, 'Толстой', 1, 3, '2024-01-16', 1, 23, 3, '2024-01-13 16:10:30', '2024-01-13 16:10:30', '65a26fa6f20a3.txt', 1, 2, ''),
(228, 'Толстой', 1, 3, '2024-01-16', 1, 23, 3, '2024-01-13 16:12:57', '2024-01-13 16:12:57', '65a270396f46e.txt', 1, 2, ''),
(229, 'paradox29', 1, 2, '2024-01-16', 1, 1, 3, '2024-01-15 10:42:35', '2024-01-15 10:42:35', '65a4c5cb5c494.txt', 1, 2, ''),
(230, 'paradox29', 1, 2, '2024-01-16', 1, 1, 3, '2024-01-15 10:43:31', '2024-01-15 10:43:31', '65a4c603e4d37.txt', 1, 2, ''),
(231, 'paradox29', 1, 2, '2024-01-16', 1, 1, 3, '2024-01-15 10:44:08', '2024-01-15 10:44:08', '65a4c6286692f.txt', 1, 2, ''),
(232, 'paradox29', 1, 2, '2024-01-16', 1, 1, 3, '2024-01-15 10:48:29', '2024-01-15 10:48:29', '65a4c72d41963.txt', 1, 2, ''),
(233, 'paradox29', 1, 2, '2024-01-16', 1, 1, 3, '2024-01-15 10:48:49', '2024-01-15 10:48:49', '65a4c741e2296.txt', 1, 2, ''),
(234, 'paradox29', 1, 2, '2024-01-16', 1, 1, 3, '2024-01-15 10:53:38', '2024-01-15 10:53:38', '65a4c862c6aa0.txt', 1, 2, ''),
(235, 'paradox29', 1, 2, '2024-01-16', 1, 1, 3, '2024-01-15 10:53:54', '2024-01-15 10:53:54', '65a4c87298a62.txt', 1, 2, ''),
(236, 'paradox29', 1, 2, '2024-01-16', 1, 1, 3, '2024-01-15 10:55:04', '2024-01-15 10:55:04', '2.txt', 1, 2, ''),
(237, 'Толстой', 2, 2, '2024-01-16', 2, 25, 2, '2024-02-23 17:23:52', '2024-01-16 09:25:39', 'photo_2024-02-23_15-00-361.jpg', 1, 2, ''),
(238, 'Толстой', 2, 2, '2024-01-16', 2, 25, 2, '2024-02-23 17:30:06', '2024-01-16 09:26:10', 'photo_2024-02-23_15-00-41.jpg', 1, 2, ''),
(239, 'Толстой', 2, 2, '2024-01-16', 2, 25, 2, '2024-02-23 17:31:03', '2024-01-16 09:26:42', 'photo_2024-02-23_15-00-26.jpg', 1, 2, ''),
(240, 'paradox29', 1, 1, '2024-01-16', 2, 30, 2, '2024-01-16 09:27:25', '2024-01-16 09:27:25', '3 цикл ним. 1 23-24 (1).pdf', 1, 2, ''),
(241, 'paradox29', 1, 1, '2024-01-16', 2, 30, 2, '2024-01-16 09:28:25', '2024-01-16 09:28:25', '3 цикл ним. 1 23-24 (1).pdf', 1, 2, ''),
(242, 'paradox29', 1, 1, '2024-01-16', 2, 30, 2, '2024-01-16 09:28:39', '2024-01-16 09:28:39', '3 цикл ним. 1 23-24 (1).pdf', 1, 2, ''),
(243, 'paradox29', 2, 3, '2024-01-16', 1, 35, 2, '2024-01-16 09:29:01', '2024-01-16 09:29:01', '16958_571297297.pdf', 1, 2, ''),
(244, 'TEst', 1, 1, '2024-01-20', 1, 1, 2, '2024-01-20 15:52:20', '2024-01-20 15:52:20', '2.txt', 1, 2, ''),
(245, 'Test', 2, 2, '2024-02-03', 1, 20, 2, '2024-02-03 12:18:26', '2024-02-03 12:18:26', 'photo_2024-02-03_10-44-04.ico', 1, 2, ''),
(246, 'Толстой', 1, 1, '2024-02-21', 1, 2, 3, '2024-02-21 11:28:29', '2024-02-21 11:28:29', '1A6A8114.png', 1, 2, ''),
(247, 'Толстой1', 1, 1, '2024-02-21', 2, 2, 3, '2024-02-21 13:26:23', '2024-02-21 13:26:23', '5e25909a739226d581c9f4ffbea293df.pdf', 1, 2, ''),
(248, 'paradox291', 1, 3, '2024-02-21', 1, 5, 3, '2024-02-21 13:35:05', '2024-02-21 13:35:05', '1553', 1, 2, ''),
(249, 'paradox293', 1, 3, '2024-02-21', 1, 5, 3, '2024-02-21 13:40:09', '2024-02-21 13:40:09', '1553', 1, 2, ''),
(250, 'paradox292', 1, 3, '2024-02-21', 1, 5, 3, '2024-02-21 13:40:52', '2024-02-21 13:40:52', '0', 1, 2, ''),
(251, 'Jahon', 1, 1, '2024-02-21', 1, 6, 2, '2024-02-21 18:02:23', '2024-02-21 18:02:23', '3 цикл ним. 1 23-24 (1).pdf', 1, 2, '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `material`
--
ALTER TABLE `material`
  ADD PRIMARY KEY (`id`),
  ADD KEY `pub_place_id` (`pub_place_id`),
  ADD KEY `language_id` (`language_id`),
  ADD KEY `type_id` (`type_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `kafedra_id` (`kafedra_id`),
  ADD KEY `material_ibfk_6` (`status`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `material`
--
ALTER TABLE `material`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=252;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `material`
--
ALTER TABLE `material`
  ADD CONSTRAINT `material_ibfk_1` FOREIGN KEY (`pub_place_id`) REFERENCES `place` (`id`),
  ADD CONSTRAINT `material_ibfk_2` FOREIGN KEY (`language_id`) REFERENCES `language` (`id`),
  ADD CONSTRAINT `material_ibfk_3` FOREIGN KEY (`type_id`) REFERENCES `type` (`id`),
  ADD CONSTRAINT `material_ibfk_4` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`),
  ADD CONSTRAINT `material_ibfk_5` FOREIGN KEY (`kafedra_id`) REFERENCES `kafedra` (`id`),
  ADD CONSTRAINT `material_ibfk_6` FOREIGN KEY (`status`) REFERENCES `material_status` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
