<?php
$language = array(
    "items" => "Ададҳо",
    "addingaNewItem" => "Илова кардани ашёи нав",
    "item" => "Адад",
    "enterItem" => "Як чизро ворид кунед",
    "add" => "Илова кардан",
    "change" => "Тағйир",
    "allThings" => "Ҳама ашё",
    "action" => "Амал",
    "delete" => "Нест кардан",
    "titleErrorDelete" => "Шумо мутмаин ҳастед, ки мехоҳед нест кунед?",
    "confirmDelete" => "ҲА, нест кунед!",
    "rejectDelete" => "НЕ, бекор кунед!",
    "titleError" => "Шумо мутмаин ҳастед, ки мехоҳед тағир диҳед?",
    "textError" => "Баъзе маълумот холӣ аст ё маълумот бо ҳамон ном вуҷуд дорад!",
    "confirmEdit" => "ҲА, тағир диҳед!",
    "rejectEdit" => "НЕ, тағир диҳед!",
    "хато" => "ХАТО",
    "муваффақият" => "ХАЗОР ШУД",
    "errorMessage" => "Чизе хато кард!",
    "declineError" => "Шумо қариб нест кардаед :)",
    "declineErrorEdit" => "Шумо қариб тағйир ёфтед :)",
    "canceled" => "Canceled",
    "changed" => "Тағйир ёфт!",
    "deleted" => "НАЗАР ШУД!",
    "added" => "Иловашуда"
);
?>