<?php
$language = array(
    "places" => "Места публикации",
    "add" => "Добавить",
    "allplaces" => "Все места публикации",
    "place" => "Место публикации",
    "action" => "Действие",
    "change" => "Изменить",
    "delete" => "Удалить",
    "placeName" => "Название места публикации",
    "close" => "Закрыть",
    "titileErrorDelete" => "Вы действительно хотите удалить?",
    "confirmDelete" => "ДА, удалить!",
    "rejectDelete" => "НЕТ, отменить!",
    "titleError" => "Вы действительно хотите изменить?",
    "textError" => "Некоторые данные пусты или данные с таким именем существует!",
    "confirmEdit" => "ДА, изменить!",
    "rejectEdit" => "НЕТ, изменить!",
    "error" => "ОШИБКА",
    "success" => "УДАЛЕНО",
    "errorMessage" => "Что то пошло не так!",
    "declineError" => "Вы чуть не удалили :)",
    "declineErrorEdit" => "Вы чуть не изменили :)",
    "canceled" => "ОТМЕНЕН",
    "changed" => "Изменено!",
    "deleted" => "УДАЛЕНО!",
    "added" => "Добавлено"
);
?>