<?php
$language = array(
    "places" => "Ҷойҳои интишор",
     "add" => "Илова кардан",
     "allplaces" => "Ҳама ҷойҳои нашр",
     "place" => "Ҷойи нашр",
     "action" => "Амал",
     "change" => "Тағйир",
     "delete" => "Нест кардан",
     "placeName" => "Номи ҷои нашр",
     "close" => "Пӯшидан",
     "titleErrorDelete" => "Шумо мутмаин ҳастед, ки мехоҳед нест кунед?",
    "confirmDelete" => "ҲА, нест кунед!",
    "rejectDelete" => "НЕ, бекор кунед!",
    "titleError" => "Шумо мутмаин ҳастед, ки мехоҳед тағир диҳед?",
    "textError" => "Баъзе маълумот холӣ аст ё маълумот бо ҳамон ном вуҷуд дорад!",
    "confirmEdit" => "ҲА, тағир диҳед!",
    "rejectEdit" => "НЕ, тағир диҳед!",
    "хато" => "ХАТО",
    "муваффақият" => "ХАЗОР ШУД",
    "errorMessage" => "Чизе хато кард!",
    "declineError" => "Шумо қариб нест кардаед :)",
    "declineErrorEdit" => "Шумо қариб тағйир ёфтед :)",
    "canceled" => "Бекор карда шуд",
    "changed" => "Тағйир ёфт!",
    "deleted" => "НАЗАР ШУД!",
    "added" => "Иловашуда"
);
?>